import React from "react";

const Coursepage = () => {
  return (
    <div>
      {/* Header Section */}
      <div
        className="container-fluid bg-dark d-flex flex-column align-items-center justify-content-center"
        style={{
          height: "50vh",
          backgroundColor: "#333", // สีพื้นหลังที่คุณต้องการ
          padding: "20px",
        }}
      >
        <div
          className="text-light d-flex flex-column align-items-center justify-content-center"
          style={{ height: "65vh", width: "80vh" }}
        >
          <h1 className="display-3 text-center" style={{ fontSize: "3rem" }}>
            ข้าวเหนียวซิวเกลี้ยงเมืองเลย
          </h1>
          <p className="fs-4 text-center" style={{ fontSize: "1.5rem" }}>
            หลักสูตรอบรม
            <br />
            สำหรับผู้ที่สนใจเรียนรู้เกี่ยวกับข้าวเหนียวซิวเกลี้ยงเมืองเลย
          </p>
        </div>
      </div>

      {/* Main Content Section */}
      <div className="d-flex justify-content-center align-content-center mt-5 px-3">
        <div
          className="d-flex flex-column"
          style={{
            width: "80%",
            maxWidth: "1200px",
            backgroundColor: "#fff",
            padding: "30px",
            borderRadius: "8px",
            boxShadow: "0 4px 12px rgba(0, 0, 0, 0.1)",
          }}
        >
          <h1 className="mb-4" style={{ fontSize: "2rem" }}>
            ข้าวเหนียวซิวเกลี้ยงเมืองเลย
          </h1>
          <p className="mb-2" style={{ fontSize: "1.25rem" }}>
            <strong>ชื่อสามัญ :</strong> Siwgleang Mueang Loei Sticky Rice หรือ Khao Neaw
            Siwgleang Mueang Loei
          </p>
          <p className="mb-2" style={{ fontSize: "1.25rem" }}>
            <strong>ชื่อวิทยาศาสตร์ :</strong> Oryza sativa L
          </p>
          <p className="mb-2" style={{ fontSize: "1.25rem" }}>
            <strong>ชื่อวงศ์ :</strong> Poaceae
          </p>
          <p className="mb-2" style={{ fontSize: "1.25rem" }}>
            <strong>อันดับ :</strong> Poales
          </p>
          <p className="mb-2" style={{ fontSize: "1.25rem" }}>
            <strong>ชั้น :</strong> Liliopsida
          </p>
          <p className="mb-2" style={{ fontSize: "1.25rem" }}>
            <strong>ไฟลัม :</strong> Magnoliophyta
          </p>

          {/* History Section */}
          <h2 className="mt-5 mb-3" style={{ fontSize: "1.75rem" }}>
            ประวัติความเป็นมา
          </h2>
          <p style={{ fontSize: "1.25rem" }}>
            ที่มาและชื่อพันธุ์ข้าวเหนียวซิวเกลี้ยง มีถิ่นกำเนิดอยู่จังหวัดเลย
            เป็นสายพันธุ์ข้าวไร่พื้นเมืองของจังหวัดเลยที่ปลูกสืบทอดมาจากบรรพบุรุษยายนานกว่า
            200 ปี ประกอบกับจังหวัดเลย
            มีสภาพภูมิประเทศเป็นพื้นที่ภูเขาและเนินเขา มีเทือกเขายาว
            โดยมีที่ราบลุ่มระหว่างหุบเขาสลับอยู่ระหว่างแนวเทือกเขา
            จึงนิยมปลูกข้าวไร่เป็นหลัก
            ซึ่งข้าวเหนียวพันธุ์ซิวเกลี้ยงเป็นสายพันธุ์ที่เกษตรกรนิยมปลูกกันมากกว่าพันธุ์อื่น
            ๆ เพราะมีลักษณะเด่นคือ
            มีอัตราการงอกสูงที่สุดเมื่อเทียบกับพันธุ์อื่น ๆ
            มีความทนทานต่อความแห้งแล้ง โรคและแมลงศัตรูพืช
            ให้ผลผลิตดีและมีปริมาณมากกว่าข้าวไร่พันธุ์พื้นเมืองอื่น ๆ
            จากคำบอกเล่าของคนท้องถิ่นในอำเภอด่านซ้ายให้ข้อมูลว่า
            ข้าวเหนียวซิวเกลี้ยง มีชื่อเดิมเรียกว่า ซิวอ้าว (ซิวแปลว่า เล็ก)
            ต่อมามีการเรียกชื่อใหม่ว่า “ซิวเกลี้ยง” 
            ตามลักษณะของเมล็ดข้าวที่ไม่มีขน โดยข้าวเหนียวซิวเกลี้ยงเมืองเลย
            มีลักษณะเด่นคือ ส่วนปลายเมล็ดข้าวเปลือกมีจุดสีน้ำตาล
            และเมื่อหุงสุกเมล็ดข้าวจะสวย มีกลิ่นหอมเล็กน้อย เหนียว นุ่ม อร่อย
            ซึ่งแตกต่างจากการปลูกในบริเวณพื้นที่ราบ
            ที่ปลายเมล็ดข้าวเปลือกไม่มีสีน้ำตาล
          </p>
          <p style={{ fontSize: "1.25rem" }}>
            ต่อมาเมื่อปี พ.ศ. 2543 ได้มีการรวมกลุ่มเกษตรกรในพื้นที่บ้านน้ำเย็น
            จัดตั้งวิสาหกิจชุมชนกลุ่มผลิตเมล็ดพันธุ์ข้าวไร่บ้านน้ำเย็น
            เพื่ออนุรักษ์พันธุ์ข้าวไร่พื้นเมืองหลายสายพันธุ์
            รวมถึงข้าวเหนียวซิวเกลี้ยงด้วย
            โดยในภายหลังได้มีการนำกลับมาปลูกอย่างแพร่หลาย ตั้งแต่ปี พ.ศ. 2543
            และได้มีกิจกรรมส่งเสริมการปลูกข้าวไร่เพื่อการท่องเที่ยว เช่น
            การจัดกิจกรรมวันข้าวไร่
            การจัดงานวันถ่ายทอดเทคโนโลยีเพื่อเริ่มต้นฤดูกาลผลิตใหม่ เป็นต้น
            ซึ่งจัดโดยสำนักงานเกษตรจังหวัดเลย สำนักงานเกษตรอำเภอด่านซ้าย
            และองค์การบริหารส่วนตำบลกกสะทอน อำเภอด่านซ้าย จังหวัดเลย
          </p>

          {/* General Description Section */}
          <h3 className="mt-5 mb-3" style={{ fontSize: "1.75rem" }}>
            ลักษณะทั่วไป
          </h3>
          <p style={{ fontSize: "1.25rem" }}>
            ข้าวเหนียวซิวเกลี้ยงเมืองเลย
            เป็นข้าวไร่พันธุ์พื้นเมืองที่ไวต่อช่วงแสง ปลูกในช่วงฤดูฝน
            ในพื้นที่ดอน เนินเขา ที่ราบลอนคลื่น และพื้นที่ราบระหว่างภูเขา
            ที่ระดับความสูง 500 – 1,000 เมตร จากระดับน้ำทะเล
            เมล็ดรูปร่างเรียวยาว ข้าวเปลือกมีสีฟาง ไม่มีขน
            ส่วนปลายเมล็ดมีจุดสีน้ำตาล เมื่อหุงสุกเมล็ดสวย เหนียวนุ่ม
            และมีกลิ่นหอมเล็กน้อย หลังจากหุงเป็นเวลานานยังคงความนุ่มไว้ได้
            ปลูกมากในพื้นที่อำเภอด่านซ้าย อำเภอภูเรือ และอำเภอนาแห้ว
          </p>

          {/* Agricultural Characteristics Section */}
          <h3 className="mt-5 mb-3" style={{ fontSize: "1.75rem" }}>
            ลักษณะทางการเกษตร
          </h3>
          <p style={{ fontSize: "1.25rem" }}>
            ความสูงของต้นกล้าเฉลี่ย 49.90 เซนติเมตร, ลำต้นยาวเฉลี่ย 61.21
            เซนติเมตร, ความยาวของรวงเฉลี่ย 17.65 เซนติเมตร, จำนวน 1 หน่อต่อกอ,
            การชูรวงเหนือใบธงชูรวงดีมาก, อายุวันออกดอก 75-78 วัน,
            ลำต้นแข็งแรงปานกลาง, มีการติดเมล็ด 90%, การร่วงของเมล็ดน้อย
            และน้ำหนัก 100 เมล็ด 3.15 กรัม
          </p>

          {/* Botanical Characteristics Section */}
          <h3 className="mt-5 mb-3" style={{ fontSize: "1.75rem" }}>
            ลักษณะทางพฤกษศาสตร์
          </h3>
          <p style={{ fontSize: "1.25rem" }}>
            แผ่นใบสีเขียวมีขนบ้างเล็กน้อย, กาบใบมีสีเขียว,
            มุมของยอดแผ่นใบตั้งตรง, สีของลิ้นใบ (เยื่อกั้นน้ำฝน),
            มีสีขาวรูปร่างแหลม, มีความยาวยาวเฉลี่ย 13.80 มิลลิเมตร,
            หูใบมีสีขาว, สีของข้อต่อใบกับกาบใบเขียว, สีของปล้องสีเขียว,
            กอตั้ง, มุมของใบธงหักลง, มุมหรือลักษณะกอตั้งตรง
            สีของปล้องด้านนอกมีสีเขียว, ไม่มีการแตกระแง้,
            ลักษณะรวงกระจายปานกลาง, ก้านรวงตั้งตรง, การแก่ของใบปานกลาง
            และการแห้งของใบใต้ใบธงแห้งช้า
          </p>

          {/* Physical Characteristics of Seeds Section */}
          <h3 className="mt-5 mb-3" style={{ fontSize: "1.75rem" }}>
            ลักษณะทางกายภาพของเมล็ด
          </h3>
          <p style={{ fontSize: "1.25rem" }}>
            เปลือกของเมล็ดสีฟางไม่มีขน, ไม่มีหางข้าว, ยอดเมล็ดมีสีฟาง,
            ข้าวกล้องสีขาว,รูปร่างเรียว, ความยาวของเมล็ดข้าวเปลือกเฉลี่ย 10.33
            มิลลิเมตร และความกว้างของเมล็ดข้าวเปลือกเฉลี่ย 3.47 มิลลิเมตร
          </p>
        </div>
      </div>
    </div>
  );
};

export default Coursepage;
